advanced instance setting &scaling mode


```
terraform apply
2021/01/23 19:25:48 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_gaap_realserver.foo: Refreshing state... [id=rs-esz66qsz]
tencentcloud_gaap_realserver.bar: Refreshing state... [id=rs-hs8762z5]
data.tencentcloud_vpc_subnets.vpc: Refreshing state...
tencentcloud_gaap_proxy.foo: Refreshing state... [id=link-bgc4son3]
data.tencentcloud_images.default: Refreshing state...
data.tencentcloud_instance_types.default: Refreshing state...
tencentcloud_gaap_layer4_listener.foo: Refreshing state... [id=listener-dtnnpd3n]
tencentcloud_gaap_layer4_listener.foo1: Refreshing state... [id=listener-3frfy4rh]
tencentcloud_instance.foo: Refreshing state... [id=ins-7ph5fqlg]
tencentcloud_kubernetes_cluster.managed_cluster: Refreshing state... [id=cls-rk2mb3ti]
tencentcloud_kubernetes_cluster_attachment.test_attach: Refreshing state... [id=ins-7ph5fqlg_cls-rk2mb3ti]
tencentcloud_kubernetes_node_pool.mynodepool: Refreshing state... [id=cls-rk2mb3ti#np-5hm1yrx8]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # tencentcloud_gaap_layer4_listener.foo will be created
  + resource "tencentcloud_gaap_layer4_listener" "foo" {
      + connect_timeout = 2
      + create_time     = (known after apply)
      + health_check    = true
      + id              = (known after apply)
      + interval        = 5
      + name            = "ci-test-gaap-4-listener"
      + port            = 80
      + protocol        = "TCP"
      + proxy_id        = (known after apply)
      + realserver_type = "IP"
      + scheduler       = "rr"
      + status          = (known after apply)

      + realserver_bind_set {
          + id     = "rs-esz66qsz"
          + ip     = "1.1.1.1"
          + port   = 80
          + weight = 1
        }
      + realserver_bind_set {
          + id     = "rs-hs8762z5"
          + ip     = "119.29.29.29"
          + port   = 80
          + weight = 1
        }
    }

  # tencentcloud_gaap_layer4_listener.foo1 will be created
  + resource "tencentcloud_gaap_layer4_listener" "foo1" {
      + connect_timeout = 2
      + create_time     = (known after apply)
      + health_check    = true
      + id              = (known after apply)
      + interval        = 5
      + name            = "ci-test-gaap-4-listener2"
      + port            = 8080
      + protocol        = "TCP"
      + proxy_id        = (known after apply)
      + realserver_type = "IP"
      + scheduler       = "rr"
      + status          = (known after apply)

      + realserver_bind_set {
          + id     = "rs-esz66qsz"
          + ip     = "1.1.1.1"
          + port   = 80
          + weight = 1
        }
      + realserver_bind_set {
          + id     = "rs-hs8762z5"
          + ip     = "119.29.29.29"
          + port   = 80
          + weight = 1
        }
    }

  # tencentcloud_gaap_proxy.foo will be created
  + resource "tencentcloud_gaap_proxy" "foo" {
      + access_region     = "SouthChina"
      + bandwidth         = 10
      + concurrent        = 2
      + create_time       = (known after apply)
      + domain            = (known after apply)
      + enable            = true
      + forward_ip        = (known after apply)
      + id                = (known after apply)
      + ip                = (known after apply)
      + name              = "ci-test-gaap-proxy"
      + project_id        = 0
      + realserver_region = "NorthChina"
      + scalable          = (known after apply)
      + status            = (known after apply)
      + support_protocols = (known after apply)
    }

  # tencentcloud_instance.foo will be created
  + resource "tencentcloud_instance" "foo" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-guangzhou-3"
      + create_time                             = (known after apply)
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-25szkc8t"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "tf-auto-test-1-1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S1.SMALL1"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_name                                = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = "subnet-1uwh63so"
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + vpc_id                                  = "vpc-h70b6b49"

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = (known after apply)
          + data_disk_snapshot_id  = (known after apply)
          + data_disk_type         = (known after apply)
          + delete_with_instance   = (known after apply)
          + encrypt                = (known after apply)
          + throughput_performance = (known after apply)
        }
    }

  # tencentcloud_kubernetes_cluster_attachment.test_attach will be created
  + resource "tencentcloud_kubernetes_cluster_attachment" "test_attach" {
      + cluster_id      = "cls-rk2mb3ti"
      + id              = (known after apply)
      + instance_id     = (known after apply)
      + labels          = {
          + "test1" = "test1"
          + "test2" = "test2"
        }
      + password        = (sensitive value)
      + security_groups = (known after apply)

      + worker_config {
          + docker_graph_path = "/var/lib/docker"
          + is_schedule       = true

          + data_disk {
              + auto_format_and_mount = true
              + disk_size             = 50
              + disk_type             = "CLOUD_PREMIUM"
              + file_system           = "ext4"
              + mount_target          = "/data"
            }
        }
    }

  # tencentcloud_kubernetes_node_pool.mynodepool will be updated in-place
  ~ resource "tencentcloud_kubernetes_node_pool" "mynodepool" {
        auto_scaling_group_id = "asg-mbz9i41g"
        cluster_id            = "cls-rk2mb3ti"
        delete_keep_instance  = true
      ~ desired_capacity      = 1 -> 4
        enable_auto_scale     = true
        id                    = "cls-rk2mb3ti#np-5hm1yrx8"
        labels                = {
            "test1" = "test1"
            "test2" = "test2"
        }
        launch_config_id      = "asc-j21jaakg"
        max_size              = 6
        min_size              = 1
        name                  = "mynodepool"
        node_os               = "tlinux2.4x86_64"
        node_os_type          = "GENERAL"
        retry_policy          = "INCREMENTAL_INTERVALS"
        status                = "normal"
        subnet_ids            = [
            "subnet-1uwh63so",
        ]
        vpc_id                = "vpc-h70b6b49"

        auto_scaling_config {
            enhanced_monitor_service  = false
            enhanced_security_service = false
            instance_type             = "S1.SMALL1"
            internet_charge_type      = "TRAFFIC_POSTPAID_BY_HOUR"
            key_ids                   = []
            password                  = (sensitive value)
            security_group_ids        = [
                "sg-24vswocp",
            ]
            system_disk_size          = 50
            system_disk_type          = "CLOUD_PREMIUM"

            data_disk {
                disk_size = 50
                disk_type = "CLOUD_PREMIUM"
            }
        }

        node_config {
            docker_graph_path = "/var/lib/docker"
            extra_args        = []
            is_schedule       = true
        }

        taints {
            effect = "PreferNoSchedule"
            key    = "test_taint"
            value  = "taint_value"
        }
        taints {
            effect = "PreferNoSchedule"
            key    = "test_taint2"
            value  = "taint_value2"
        }
    }

  # tencentcloud_kubernetes_node_pool.mynodepool2 will be created
  + resource "tencentcloud_kubernetes_node_pool" "mynodepool2" {
      + auto_scaling_group_id = (known after apply)
      + cluster_id            = "cls-rk2mb3ti"
      + delete_keep_instance  = true
      + desired_capacity      = 4
      + enable_auto_scale     = true
      + id                    = (known after apply)
      + labels                = {
          + "test1" = "test1"
          + "test2" = "test2"
        }
      + launch_config_id      = (known after apply)
      + max_size              = 6
      + min_size              = 1
      + name                  = "mynodepool"
      + node_count            = (known after apply)
      + node_os               = "tlinux2.4x86_64"
      + node_os_type          = "GENERAL"
      + retry_policy          = "INCREMENTAL_INTERVALS"
      + scaling_mode          = "WAKE_UP_STOPPED_SCALING"
      + status                = (known after apply)
      + subnet_ids            = [
          + "subnet-1uwh63so",
        ]
      + vpc_id                = "vpc-h70b6b49"

      + auto_scaling_config {
          + enhanced_monitor_service  = false
          + enhanced_security_service = false
          + instance_type             = "S1.SMALL1"
          + internet_charge_type      = "TRAFFIC_POSTPAID_BY_HOUR"
          + password                  = (sensitive value)
          + security_group_ids        = [
              + "sg-24vswocp",
            ]
          + system_disk_size          = 50
          + system_disk_type          = "CLOUD_PREMIUM"

          + data_disk {
              + disk_size = 50
              + disk_type = "CLOUD_PREMIUM"
            }
        }

      + taints {
          + effect = "PreferNoSchedule"
          + key    = "test_taint"
          + value  = "taint_value"
        }
      + taints {
          + effect = "PreferNoSchedule"
          + key    = "test_taint2"
          + value  = "taint_value2"
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_gaap_proxy.foo: Creating...
tencentcloud_instance.foo: Creating...
tencentcloud_kubernetes_node_pool.mynodepool2: Creating...
tencentcloud_kubernetes_node_pool.mynodepool: Modifying... [id=cls-rk2mb3ti#np-5hm1yrx8]
tencentcloud_kubernetes_node_pool.mynodepool: Modifications complete after 1s [id=cls-rk2mb3ti#np-5hm1yrx8]
tencentcloud_kubernetes_node_pool.mynodepool2: Creation complete after 6s [id=cls-rk2mb3ti#np-7hvfdsxm]
tencentcloud_gaap_proxy.foo: Still creating... [10s elapsed]
tencentcloud_instance.foo: Still creating... [10s elapsed]
tencentcloud_instance.foo: Creation complete after 20s [id=ins-qyrmh9r8]
tencentcloud_kubernetes_cluster_attachment.test_attach: Creating...
tencentcloud_gaap_proxy.foo: Still creating... [20s elapsed]
tencentcloud_gaap_proxy.foo: Creation complete after 28s [id=link-7drg5i9f]
tencentcloud_gaap_layer4_listener.foo1: Creating...
tencentcloud_gaap_layer4_listener.foo: Creating...
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [10s elapsed]
tencentcloud_gaap_layer4_listener.foo1: Still creating... [10s elapsed]
tencentcloud_gaap_layer4_listener.foo: Still creating... [10s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [20s elapsed]
tencentcloud_gaap_layer4_listener.foo: Creation complete after 19s [id=listener-h3ztm3bl]
tencentcloud_gaap_layer4_listener.foo1: Still creating... [20s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [30s elapsed]
tencentcloud_gaap_layer4_listener.foo1: Still creating... [30s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [40s elapsed]
tencentcloud_gaap_layer4_listener.foo1: Creation complete after 37s [id=listener-18k4h1dl]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [50s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m0s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m10s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m20s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m30s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m40s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [1m50s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m0s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m10s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m20s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m30s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m40s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Still creating... [2m50s elapsed]
tencentcloud_kubernetes_cluster_attachment.test_attach: Creation complete after 2m50s [id=ins-qyrmh9r8_cls-rk2mb3ti]

Apply complete! Resources: 6 added, 1 changed, 0 destroyed.

```

tfstate view

```
{
  "version": 4,
  "terraform_version": "0.12.19",
  "serial": 105,
  "lineage": "e7dc06c2-b3af-8071-04da-195d15783717",
  "outputs": {},
  "resources": [
    {
      "mode": "data",
      "type": "tencentcloud_images",
      "name": "default",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "id": "2577043975",
            "image_id": null,
            "image_name_regex": null,
            "image_type": [
              "PUBLIC_IMAGE"
            ],
            "images": [
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 8.0 64bit",
                "image_id": "img-25szkc8t",
                "image_name": "CentOS 8.0 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 8.0 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 7.8 64bit",
                "image_id": "img-3la7wgnt",
                "image_name": "CentOS 7.8 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 7.8 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 7.7 64bit",
                "image_id": "img-1u6l2i9l",
                "image_name": "CentOS 7.7 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 7.7 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 7.6 64bit",
                "image_id": "img-9qabwvbn",
                "image_name": "CentOS 7.6 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 7.6 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 7.5 64bit",
                "image_id": "img-oikl1tzv",
                "image_name": "CentOS 7.5 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 7.5 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 7.4 64bit",
                "image_id": "img-8toqc6s3",
                "image_name": "CentOS 7.4 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 7.4 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 7.3 64bit",
                "image_id": "img-dkwyg6sr",
                "image_name": "CentOS 7.3 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 7.3 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 7.2 64bit",
                "image_id": "img-31tjrtph",
                "image_name": "CentOS 7.2 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 7.2 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 6.9 64bit",
                "image_id": "img-i5u2lkoz",
                "image_name": "CentOS 6.9 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 6.9 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "i386",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 6.9 32bit",
                "image_id": "img-rtp44ucv",
                "image_name": "CentOS 6.9 32bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 6.9 32bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 6.8 64bit",
                "image_id": "img-6ns5om13",
                "image_name": "CentOS 6.8 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 6.8 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              },
              {
                "architecture": "x86_64",
                "created_time": "",
                "image_creator": "",
                "image_description": "CentOS 8.2 64bit",
                "image_id": "img-n7nyt2d7",
                "image_name": "CentOS 8.2 64bit",
                "image_size": 50,
                "image_source": "OFFICIAL",
                "image_state": "NORMAL",
                "image_type": "PUBLIC_IMAGE",
                "os_name": "CentOS 8.2 64bit",
                "platform": "CentOS",
                "snapshots": [],
                "support_cloud_init": true,
                "sync_percent": 0
              }
            ],
            "os_name": "centos",
            "result_output_file": null
          }
        }
      ]
    },
    {
      "mode": "data",
      "type": "tencentcloud_instance_types",
      "name": "default",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "availability_zone": null,
            "cpu_core_count": 8,
            "exclude_sold_out": false,
            "filter": [
              {
                "name": "instance-family",
                "values": [
                  "SA2"
                ]
              }
            ],
            "gpu_core_count": null,
            "id": "58761407",
            "instance_types": [
              {
                "availability_zone": "ap-guangzhou-3",
                "cpu_core_count": 8,
                "family": "SA2",
                "gpu_core_count": 0,
                "instance_type": "SA2.2XLARGE16",
                "memory_size": 16
              },
              {
                "availability_zone": "ap-guangzhou-5",
                "cpu_core_count": 8,
                "family": "SA2",
                "gpu_core_count": 0,
                "instance_type": "SA2.2XLARGE16",
                "memory_size": 16
              },
              {
                "availability_zone": "ap-guangzhou-6",
                "cpu_core_count": 8,
                "family": "SA2",
                "gpu_core_count": 0,
                "instance_type": "SA2.2XLARGE16",
                "memory_size": 16
              },
              {
                "availability_zone": "ap-guangzhou-4",
                "cpu_core_count": 8,
                "family": "SA2",
                "gpu_core_count": 0,
                "instance_type": "SA2.2XLARGE16",
                "memory_size": 16
              }
            ],
            "memory_size": 16,
            "result_output_file": null
          }
        }
      ]
    },
    {
      "mode": "data",
      "type": "tencentcloud_vpc_subnets",
      "name": "vpc",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "availability_zone": "ap-guangzhou-3",
            "cidr_block": null,
            "id": "515108a726ede70670174519bf2c8902",
            "instance_list": [
              {
                "availability_zone": "ap-guangzhou-3",
                "available_ip_count": 4072,
                "cidr_block": "172.16.0.0/20",
                "create_time": "2019-07-24 16:51:00",
                "is_default": true,
                "is_multicast": false,
                "name": "Default-Subnet-Terraform-Keep",
                "route_table_id": "rtb-4ux9eaoc",
                "subnet_id": "subnet-1uwh63so",
                "tags": {},
                "vpc_id": "vpc-h70b6b49"
              }
            ],
            "is_default": true,
            "is_remote_vpc_snat": null,
            "name": null,
            "result_output_file": null,
            "subnet_id": null,
            "tag_key": null,
            "tags": null,
            "vpc_id": null
          }
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_gaap_layer4_listener",
      "name": "foo",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "connect_timeout": 2,
            "create_time": "2021-01-23T11:26:38Z",
            "health_check": true,
            "id": "listener-h3ztm3bl",
            "interval": 5,
            "name": "ci-test-gaap-4-listener",
            "port": 80,
            "protocol": "TCP",
            "proxy_id": "link-7drg5i9f",
            "realserver_bind_set": [
              {
                "id": "rs-esz66qsz",
                "ip": "1.1.1.1",
                "port": 80,
                "weight": 1
              },
              {
                "id": "rs-hs8762z5",
                "ip": "119.29.29.29",
                "port": 80,
                "weight": 1
              }
            ],
            "realserver_type": "IP",
            "scheduler": "rr",
            "status": 0
          },
          "private": "bnVsbA==",
          "dependencies": [
            "tencentcloud_gaap_proxy.foo",
            "tencentcloud_gaap_realserver.bar",
            "tencentcloud_gaap_realserver.foo"
          ]
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_gaap_layer4_listener",
      "name": "foo1",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "connect_timeout": 2,
            "create_time": "2021-01-23T11:26:56Z",
            "health_check": true,
            "id": "listener-18k4h1dl",
            "interval": 5,
            "name": "ci-test-gaap-4-listener2",
            "port": 8080,
            "protocol": "TCP",
            "proxy_id": "link-7drg5i9f",
            "realserver_bind_set": [
              {
                "id": "rs-esz66qsz",
                "ip": "1.1.1.1",
                "port": 80,
                "weight": 1
              },
              {
                "id": "rs-hs8762z5",
                "ip": "119.29.29.29",
                "port": 80,
                "weight": 1
              }
            ],
            "realserver_type": "IP",
            "scheduler": "rr",
            "status": 0
          },
          "private": "bnVsbA==",
          "dependencies": [
            "tencentcloud_gaap_proxy.foo",
            "tencentcloud_gaap_realserver.bar",
            "tencentcloud_gaap_realserver.foo"
          ]
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_gaap_proxy",
      "name": "foo",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "access_region": "SouthChina",
            "bandwidth": 10,
            "concurrent": 2,
            "create_time": "2021-01-23T11:26:51Z",
            "domain": "link-7drg5i9f.gaapqcloud.com",
            "enable": true,
            "forward_ip": "154.8.162.186;62.234.13.134;",
            "id": "link-7drg5i9f",
            "ip": "159.75.190.193",
            "name": "ci-test-gaap-proxy",
            "project_id": 0,
            "realserver_region": "NorthChina",
            "scalable": true,
            "status": "RUNNING",
            "support_protocols": [
              "TCP",
              "UDP"
            ],
            "tags": null
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_gaap_realserver",
      "name": "bar",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "domain": null,
            "id": "rs-hs8762z5",
            "ip": "119.29.29.29",
            "name": "ci-test-gaap-realserver2",
            "project_id": 0,
            "tags": {}
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_gaap_realserver",
      "name": "foo",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "domain": null,
            "id": "rs-esz66qsz",
            "ip": "1.1.1.1",
            "name": "ci-test-gaap-realserver",
            "project_id": 0,
            "tags": {}
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_instance",
      "name": "foo",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "allocate_public_ip": false,
            "availability_zone": "ap-guangzhou-3",
            "create_time": "2021-01-23T11:26:22Z",
            "data_disks": [],
            "disable_monitor_service": false,
            "disable_security_service": false,
            "expired_time": "",
            "force_delete": false,
            "hostname": null,
            "id": "ins-qyrmh9r8",
            "image_id": "img-25szkc8t",
            "instance_charge_type": "POSTPAID_BY_HOUR",
            "instance_charge_type_prepaid_period": null,
            "instance_charge_type_prepaid_renew_flag": "",
            "instance_name": "tf-auto-test-1-1",
            "instance_status": "RUNNING",
            "instance_type": "S1.SMALL1",
            "internet_charge_type": "TRAFFIC_POSTPAID_BY_HOUR",
            "internet_max_bandwidth_out": 0,
            "keep_image_login": null,
            "key_name": "",
            "password": null,
            "placement_group_id": null,
            "private_ip": "172.16.2.119",
            "project_id": 0,
            "public_ip": null,
            "running_flag": true,
            "security_groups": [
              "sg-nltpbqg1"
            ],
            "spot_instance_type": null,
            "spot_max_price": null,
            "subnet_id": "subnet-1uwh63so",
            "system_disk_id": "disk-f3ed3qqq",
            "system_disk_size": 50,
            "system_disk_type": "CLOUD_PREMIUM",
            "tags": null,
            "user_data": null,
            "user_data_raw": null,
            "vpc_id": "vpc-h70b6b49"
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_kubernetes_cluster",
      "name": "managed_cluster",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "certification_authority": "-----BEGIN CERTIFICATE-----\nMIICyDCCAbCgAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl\ncm5ldGVzMB4XDTIxMDEyMzA5MTY1NVoXDTMxMDEyMTA5MTY1NVowFTETMBEGA1UE\nAxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAME4\nH1WCW4RXmZRNcIJPeCcVuttX6F8hZp+sJOnEym2xdmBVS81rLkMY0dfFNoH+6WBE\n2xmNpyIjaltCgSjIUhlU/oUAunZz6+aLpmfPI/lgWa78Hc4e8oHH+WB1ftIFjfhO\nkfQ3QZC1CHIngfw0MhI5t5gf97OI+RuExSgaSVXplhLLLKFsMG/GdrqlmG+eM8bN\nqxpsUE4hzJ4tiPs5CQ4Z3gxcCcTHTTK4OdGpYrDNOCWGh3XllijaPN3VxbWMHdE3\nxRprefD/O89xxTDu4yt1qvcZaMBL5PE5huNLcxAqG6KWzq28jgXK0icKpq2IsiKV\nwjwFMSngHlXiImkrOLcCAwEAAaMjMCEwDgYDVR0PAQH/BAQDAgKUMA8GA1UdEwEB\n/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAHHOAde4Yd8XlCUdkM+0YgltZ/FK\neyKhTypSXEej/dtZaHKDBXDnXiBQ6ok2jC7AcmybJMLtM/qA5eMOscB8CTdJadIA\ngCDrxJA/5LS/ACGTlGYjlr1XDhbC6HnArJa0WCtpjXASNzb7RAzcWRryXsNwvFx6\n6P/QAcwq/QrCXp1mrEgMCkE66mcHTe4519Zkefk2zzwh0JvPgTRPrIRo1D78CojV\nTWwuqAixGxQ0zIwYahw3CaeOoZyiiFPZDCKihGJ2eS6Sqs8GKmeD11LKeLYmjHUF\nocbyLFq6mEGHPoxOTNptmQSm4NX7qfbJoWv2RPlEZ2uZ/HxguarbjVGN2Zo=\n-----END CERTIFICATE-----\n",
            "claim_expired_seconds": 300,
            "cluster_as_enabled": false,
            "cluster_cidr": "10.1.0.0/16",
            "cluster_deploy_type": "MANAGED_CLUSTER",
            "cluster_desc": "test cluster desc",
            "cluster_external_endpoint": "",
            "cluster_extra_args": [],
            "cluster_internet": false,
            "cluster_intranet": false,
            "cluster_intranet_subnet_id": null,
            "cluster_ipvs": true,
            "cluster_max_pod_num": 32,
            "cluster_max_service_num": 32,
            "cluster_name": "keep",
            "cluster_node_num": 2,
            "cluster_os": "ubuntu16.04.1 LTSx86_64",
            "cluster_os_type": "GENERAL",
            "cluster_version": "1.10.5",
            "container_runtime": "docker",
            "deletion_protection": false,
            "docker_graph_path": null,
            "domain": "cls-rk2mb3ti.ccs.tencent-cloud.com",
            "eni_subnet_ids": null,
            "extra_args": null,
            "id": "cls-rk2mb3ti",
            "ignore_cluster_cidr_conflict": false,
            "is_non_static_ip_mode": false,
            "kube_config": "apiVersion: v1\nclusters:\n- cluster:\n    certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUN5RENDQWJDZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1ERXlNekE1TVRZMU5Wb1hEVE14TURFeU1UQTVNVFkxTlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTUU0CkgxV0NXNFJYbVpSTmNJSlBlQ2NWdXR0WDZGOGhacCtzSk9uRXltMnhkbUJWUzgxckxrTVkwZGZGTm9IKzZXQkUKMnhtTnB5SWphbHRDZ1NqSVVobFUvb1VBdW5aejYrYUxwbWZQSS9sZ1dhNzhIYzRlOG9ISCtXQjFmdElGamZoTwprZlEzUVpDMUNISW5nZncwTWhJNXQ1Z2Y5N09JK1J1RXhTZ2FTVlhwbGhMTExLRnNNRy9HZHJxbG1HK2VNOGJOCnF4cHNVRTRoeko0dGlQczVDUTRaM2d4Y0NjVEhUVEs0T2RHcFlyRE5PQ1dHaDNYbGxpamFQTjNWeGJXTUhkRTMKeFJwcmVmRC9PODl4eFREdTR5dDFxdmNaYU1CTDVQRTVodU5MY3hBcUc2S1d6cTI4amdYSzBpY0twcTJJc2lLVgp3andGTVNuZ0hsWGlJbWtyT0xjQ0F3RUFBYU1qTUNFd0RnWURWUjBQQVFIL0JBUURBZ0tVTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQkFISE9BZGU0WWQ4WGxDVWRrTSswWWdsdFovRksKZXlLaFR5cFNYRWVqL2R0WmFIS0RCWERuWGlCUTZvazJqQzdBY215YkpNTHRNL3FBNWVNT3NjQjhDVGRKYWRJQQpnQ0RyeEpBLzVMUy9BQ0dUbEdZamxyMVhEaGJDNkhuQXJKYTBXQ3RwalhBU056YjdSQXpjV1JyeVhzTnd2Rng2CjZQL1FBY3dxL1FyQ1hwMW1yRWdNQ2tFNjZtY0hUZTQ1MTlaa2VmazJ6endoMEp2UGdUUlBySVJvMUQ3OENvalYKVFd3dXFBaXhHeFEwekl3WWFodzNDYWVPb1p5aWlGUFpEQ0tpaEdKMmVTNlNxczhHS21lRDExTEtlTFltakhVRgpvY2J5TEZxNm1FR0hQb3hPVE5wdG1RU200Tlg3cWZiSm9XdjJSUGxFWjJ1Wi9IeGd1YXJialZHTjJabz0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=\n    server: https://cls-rk2mb3ti.ccs.tencent-cloud.com\n  name: cls-rk2mb3ti\ncontexts:\n- context:\n    cluster: cls-rk2mb3ti\n    user: \"100010914888\"\n  name: cls-rk2mb3ti-100010914888-context-default\ncurrent-context: cls-rk2mb3ti-100010914888-context-default\nkind: Config\npreferences: {}\nusers:\n- name: \"100010914888\"\n  user:\n    client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURERENDQWZTZ0F3SUJBZ0lJWFpXWVBDTVlIblF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TVRBeE1qTXdPVEl3TWpsYUZ3MDBNVEF4TWpNd09USXdNamhhTURZeApFakFRQmdOVkJBb1RDWFJyWlRwMWMyVnljekVnTUI0R0ExVUVBeE1YTVRBd01ERXdPVEUwT0RnNExURTJNVEV6Ck9UTTJNamd3Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQzFuWmZ2OHFIVVVZYzIKVWJwOVhINWx2R2VCOWViZk1BaHlOVzF2U2dJcFcrcTF1RGZHVzZlS09nemMzUVB1Z3pZa1pOMkJ4akhhMUU2Rgpta3c1b2NVbEdTQXZmejEvVVdYdjZmMXhIVlBwUVQ3WCtpMEJKOGU1cTlScUZ6ZDJydWpQTlgwaVpqTVFaZkpTCjdONDNXWmpJeTRlN0puSHdFNVRQdWE5a2pYL1hKc2hseVhWNTJpOE5IVFVVdW5aL052cm1BSGZoS3BYUW96NDYKQ0gzV1VsdEpIcEhYVGRIRVZlUWZXQlJTcFJMNXlTajEwK0pBa0crU0czRTBFcE1yQTVwZ0VvbFV6MWJZMEVXSgpxSC9aY0Y0NUdNSjU4ZVhDbkdKanhJRXRBeXIwOHRJam0vWWRSdW9LdnJOV3padTBIS0FxNzRoQkhvd3gxeGZzClErRkptdmJUQWdNQkFBR2pQekE5TUE0R0ExVWREd0VCL3dRRUF3SUNoREFkQmdOVkhTVUVGakFVQmdnckJnRUYKQlFjREFnWUlLd1lCQlFVSEF3RXdEQVlEVlIwVEFRSC9CQUl3QURBTkJna3Foa2lHOXcwQkFRc0ZBQU9DQVFFQQprZXJMQ2tURGdqRmFNQTBjNHI4eWF3T3ArcWRBSFhKYVVUQUo3c2Z0d05qZFJkUjJwS05lR0VMQzkwT245blR6CmhNVmt4RFlPcTlvSTlSQkczSDg2SG00cC9ycWlzT1IrYk1SZ0RLQXVzVnc3MG9nbWFHMTcyUUd6aDZ2WjluWmkKdWFVQ2YrR2JTeiszaExvRXVLOXo2b3FEbmJCWGpKbXFDWVlOZ3FMeFVqdjZXOW1pdHpud0JUTXFxLzBuaU5kRgpYeTM5TUt0WFF1enhDbloycVJwOS91SmovcG9Md0pkRm1ObzhocHpiaTNudjdaRnNRazVRT1hqa2FxcGtDdHMzCmZkc1NHa1E0TUVVckhTdVJBRkdXc2NDUVBybFdQb2Rpb2pYUU43Sm1hYjg5N2FzNnh5NDUwb2pTUk5STHBudG8KVnU3a015YU9Vcm9rbUJlQ3BhUStHQT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K\n    client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFb3dJQkFBS0NBUUVBdFoyWDcvS2gxRkdITmxHNmZWeCtaYnhuZ2ZYbTN6QUljalZ0YjBvQ0tWdnF0YmczCnhsdW5pam9NM04wRDdvTTJKR1RkZ2NZeDJ0Uk9oWnBNT2FIRkpSa2dMMzg5ZjFGbDcrbjljUjFUNlVFKzEvb3QKQVNmSHVhdlVhaGMzZHE3b3p6VjlJbVl6RUdYeVV1emVOMW1ZeU11SHV5Wng4Qk9VejdtdlpJMS8xeWJJWmNsMQplZG92RFIwMUZMcDJmemI2NWdCMzRTcVYwS00rT2doOTFsSmJTUjZSMTAzUnhGWGtIMWdVVXFVUytja285ZFBpClFKQnZraHR4TkJLVEt3T2FZQktKVk05VzJOQkZpYWgvMlhCZU9SakNlZkhsd3B4aVk4U0JMUU1xOVBMU0k1djIKSFVicUNyNnpWczJidEJ5Z0t1K0lRUjZNTWRjWDdFUGhTWnIyMHdJREFRQUJBb0lCQUYyQXRuRzkzRjFnWUJteQpPQzVFaVhxOVpoajl6aEJJUFlEM1N0RktMQlM1RXZ6ZHpERmVqTUpZb3JpdlBVLzEwOUVtOFBmWVgyQ0hmNm0vClI5RkFIU3k5WTltd1M2d1o3ejUybkpvNC9ET1IrTlhmSW41K3laQXBEQ0pXczZKeDZNQ05qRkJDaDdYQWx1TGsKdW4rS3JHTnNqZ1BuaGkrUkZVTmhHUkRPM091YVdNcFdCN2FJeFlia2VDVDUvZHl6QmIvWVkvNFN6TjRMYnc3NgpSQm5OYnB4WVZPK2xzZFpVY0dQNGdRbzBmMklnSC8xUjJkSS9zeUgyeEpNM2R2QnpEL3pxVGVQQVFESkhjRHgxCmp1RXNxL1NhbGh2bUlYcFJueTRJUmRhYmJsR2pYSEpobUJ3Y0hlNlRrUXdRVW1TSXRSUm5JOTlXVHNBY1VCRHMKOVhjbC9HRUNnWUVBNEpXMDhDQ2h3NEZWblg4SFNKOHBlVzlrekRUOWwwNEY2QTFvMlJ3ZVpVSVF4Z256TXlJZApyeERZVE8vazYxS3IrUUpaYWVwSnp1cGxYOGRMQ3F3YVVGTGlIOTI2VWRwcXQzTm1YdUpBOHVRbDBXbWlRZ21VClAydkFFODhOOS8rRDQ5WGZJNUtxbk1jYWsvUDc3M3NNU2FwV3NtY0VxZUsyZGI0a2hsT3RjZ01DZ1lFQXp3VXQKUXkwYXpKYkdCMlRoL2xZSzFPU3N0bk5SbkVtU1dYeWU1RWp0ODJPT3ZSTlhXSXpwbnY1a2JVaENkQUYzV2xLQQpkb0FLSGQ2UFZNNloyMlRzMGxOV2xhN1kxcEk0bHQyNlF4WlhlbzZwS0lIaDE1bkhnVVhaM1N4TUtCZmpwdDgrCnFKb0N5Q3YzR1dNb1hGaUsyZnJ3WjZMMHRxL2kvSEdCR1MzQ052RUNnWUVBd25MOGFWaG5sdVdaWWpjRThHelcKTlEwc29kNVRucmh3UnIydGhTVmliOXVtdUVFUEw3dWZKZCtZMSt4eE1RcXdXWFllUXFVVzZLOXJ2R1RLWldBagpuRjVXNks1S3p1b2tzZGVaMEJkbmtxWFUxSjc0WE9MOFYza01vbG9JeHl1Vlh5UGpBbUxQazlTVC8zd2xLdkZICjcxUXJvbVd0MVFXMVl2YVJtemhDR1U4Q2dZQVk4UzY2NFR4Uldma1IrdjJmZnc1ZkNBNG5EVTNQM3ExYlNzQjYKRUs5YW02d2U2NjJpWlpmZ0tCWkJkR3ROUHIvNmllWWdZTnpYTEhGb2JsdnJLd1c5Y1gwRkc4UFVWbG1yRTV2VgphV093eUc5cENmMEQxT3RNai9YbngrYUZEaHZIaHk0dGNpRFRyVGhnUHFvbU5pVEVqbzlZYlRHK3NRSlFGL3pOCjQ4MTZnUUtCZ0hWRUFTQ2lHYVlPaFVmcHRKTjBiRTdiemw4Y29Ydi84bTJrNnBlbjF3dG1RbEFmc2dnUUZqblAKLyt3cGhUVzlyY3RGTTVKMUFnd1d1Snd3WndkT2lsL3RheEVKNFpvZit4NXF4VkxxY1owM2h0c3BzVWVZeC9ISAozd3RkaVJDaWtLcEVKcStpelJrUGllQm9sRW5sSGVDR2lZNkUxdTIrbThNRExIUlc5K1ZPCi0tLS0tRU5EIFJTQSBQUklWQVRFIEtFWS0tLS0tCg==\n",
            "kube_proxy_mode": null,
            "labels": null,
            "managed_cluster_internet_security_policies": null,
            "master_config": [],
            "mount_target": null,
            "network_type": "GR",
            "node_name_type": "lan-ip",
            "password": "l6H9tkcxgsmHtidxaWJXA0f580EaYFXK",
            "pgw_endpoint": "",
            "project_id": 0,
            "security_policy": [],
            "service_cidr": null,
            "tags": {},
            "user_name": "admin",
            "vpc_id": "vpc-h70b6b49",
            "worker_config": [
              {
                "availability_zone": "ap-guangzhou-3",
                "cam_role_name": "",
                "count": 1,
                "data_disk": [
                  {
                    "disk_size": 50,
                    "disk_type": "CLOUD_PREMIUM",
                    "snapshot_id": ""
                  }
                ],
                "enhanced_monitor_service": false,
                "enhanced_security_service": false,
                "instance_charge_type": "POSTPAID_BY_HOUR",
                "instance_charge_type_prepaid_period": 1,
                "instance_charge_type_prepaid_renew_flag": "NOTIFY_AND_MANUAL_RENEW",
                "instance_name": "sub machine of tke",
                "instance_type": "S1.SMALL1",
                "internet_charge_type": "TRAFFIC_POSTPAID_BY_HOUR",
                "internet_max_bandwidth_out": 100,
                "key_ids": [],
                "password": "ZZXXccvv1212",
                "public_ip_assigned": true,
                "security_group_ids": [],
                "subnet_id": "subnet-1uwh63so",
                "system_disk_size": 60,
                "system_disk_type": "CLOUD_SSD",
                "user_data": "dGVzdA=="
              }
            ],
            "worker_instances_list": [
              {
                "failed_reason": "=Ready:True",
                "instance_id": "ins-lj7rq0ay",
                "instance_role": "WORKER",
                "instance_state": "running"
              },
              {
                "failed_reason": "=Ready:True",
                "instance_id": "ins-3ijdks9s",
                "instance_role": "WORKER",
                "instance_state": "running"
              }
            ]
          },
          "private": "bnVsbA=="
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_kubernetes_cluster_attachment",
      "name": "test_attach",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "cluster_id": "cls-rk2mb3ti",
            "id": "ins-qyrmh9r8_cls-rk2mb3ti",
            "instance_id": "ins-qyrmh9r8",
            "key_ids": null,
            "labels": {
              "test1": "test1",
              "test2": "test2"
            },
            "password": "Lo4wbdit",
            "security_groups": [
              "sg-nltpbqg1"
            ],
            "worker_config": [
              {
                "data_disk": [
                  {
                    "auto_format_and_mount": true,
                    "disk_size": 50,
                    "disk_type": "CLOUD_PREMIUM",
                    "file_system": "ext4",
                    "mount_target": "/data"
                  }
                ],
                "docker_graph_path": "/var/lib/docker",
                "extra_args": null,
                "is_schedule": true,
                "mount_target": "",
                "user_data": ""
              }
            ]
          },
          "private": "bnVsbA==",
          "dependencies": [
            "tencentcloud_instance.foo",
            "tencentcloud_kubernetes_cluster.managed_cluster"
          ]
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_kubernetes_node_pool",
      "name": "mynodepool",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "auto_scaling_config": [
              {
                "data_disk": [
                  {
                    "disk_size": 50,
                    "disk_type": "CLOUD_PREMIUM",
                    "snapshot_id": ""
                  }
                ],
                "enhanced_monitor_service": false,
                "enhanced_security_service": false,
                "instance_type": "S1.SMALL1",
                "internet_charge_type": "TRAFFIC_POSTPAID_BY_HOUR",
                "key_ids": [],
                "password": "test123#",
                "security_group_ids": [
                  "sg-24vswocp"
                ],
                "system_disk_size": 50,
                "system_disk_type": "CLOUD_PREMIUM"
              }
            ],
            "auto_scaling_group_id": "asg-mbz9i41g",
            "cluster_id": "cls-rk2mb3ti",
            "delete_keep_instance": true,
            "desired_capacity": 4,
            "enable_auto_scale": true,
            "id": "cls-rk2mb3ti#np-5hm1yrx8",
            "labels": {
              "test1": "test1",
              "test2": "test2"
            },
            "launch_config_id": "asc-j21jaakg",
            "max_size": 6,
            "min_size": 1,
            "name": "mynodepool",
            "node_config": [
              {
                "data_disk": [],
                "docker_graph_path": "/var/lib/docker",
                "extra_args": [],
                "is_schedule": true,
                "mount_target": "",
                "user_data": ""
              }
            ],
            "node_count": null,
            "node_os": "tlinux2.4x86_64",
            "node_os_type": "GENERAL",
            "retry_policy": "INCREMENTAL_INTERVALS",
            "scaling_mode": null,
            "status": "normal",
            "subnet_ids": [
              "subnet-1uwh63so"
            ],
            "taints": [
              {
                "effect": "PreferNoSchedule",
                "key": "test_taint",
                "value": "taint_value"
              },
              {
                "effect": "PreferNoSchedule",
                "key": "test_taint2",
                "value": "taint_value2"
              }
            ],
            "vpc_id": "vpc-h70b6b49"
          },
          "private": "bnVsbA==",
          "dependencies": [
            "tencentcloud_kubernetes_cluster.managed_cluster"
          ]
        }
      ]
    },
    {
      "mode": "managed",
      "type": "tencentcloud_kubernetes_node_pool",
      "name": "mynodepool2",
      "provider": "provider.tencentcloud",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "auto_scaling_config": [
              {
                "data_disk": [
                  {
                    "disk_size": 50,
                    "disk_type": "CLOUD_PREMIUM",
                    "snapshot_id": ""
                  }
                ],
                "enhanced_monitor_service": false,
                "enhanced_security_service": false,
                "instance_type": "S1.SMALL1",
                "internet_charge_type": "TRAFFIC_POSTPAID_BY_HOUR",
                "key_ids": null,
                "password": "test123#",
                "security_group_ids": [
                  "sg-24vswocp"
                ],
                "system_disk_size": 50,
                "system_disk_type": "CLOUD_PREMIUM"
              }
            ],
            "auto_scaling_group_id": "asg-qpaxshr0",
            "cluster_id": "cls-rk2mb3ti",
            "delete_keep_instance": true,
            "desired_capacity": 4,
            "enable_auto_scale": true,
            "id": "cls-rk2mb3ti#np-7hvfdsxm",
            "labels": {
              "test1": "test1",
              "test2": "test2"
            },
            "launch_config_id": "asc-2pb28ove",
            "max_size": 6,
            "min_size": 1,
            "name": "mynodepool",
            "node_config": [],
            "node_count": null,
            "node_os": "tlinux2.4x86_64",
            "node_os_type": "GENERAL",
            "retry_policy": "INCREMENTAL_INTERVALS",
            "scaling_mode": "WAKE_UP_STOPPED_SCALING",
            "status": "updating",
            "subnet_ids": [
              "subnet-1uwh63so"
            ],
            "taints": [
              {
                "effect": "PreferNoSchedule",
                "key": "test_taint",
                "value": "taint_value"
              },
              {
                "effect": "PreferNoSchedule",
                "key": "test_taint2",
                "value": "taint_value2"
              }
            ],
            "vpc_id": "vpc-h70b6b49"
          },
          "private": "bnVsbA==",
          "dependencies": [
            "tencentcloud_kubernetes_cluster.managed_cluster"
          ]
        }
      ]
    }
  ]
}

```

old tf state in new version

```
$ terraform apply
2021/01/23 18:10:44 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_gaap_realserver.foo: Refreshing state... [id=rs-esz66qsz]
tencentcloud_gaap_proxy.foo: Refreshing state... [id=link-bgc4son3]
tencentcloud_gaap_realserver.bar: Refreshing state... [id=rs-hs8762z5]
data.tencentcloud_instance_types.default: Refreshing state...
data.tencentcloud_images.default: Refreshing state...
data.tencentcloud_vpc_subnets.vpc: Refreshing state...
tencentcloud_gaap_layer4_listener.foo: Refreshing state... [id=listener-dtnnpd3n]
tencentcloud_gaap_layer4_listener.foo1: Refreshing state... [id=listener-3frfy4rh]
tencentcloud_kubernetes_cluster.managed_cluster: Refreshing state... [id=cls-rk2mb3ti]
tencentcloud_instance.foo: Refreshing state... [id=ins-7ph5fqlg]
tencentcloud_kubernetes_cluster_attachment.test_attach: Refreshing state... [id=ins-7ph5fqlg_cls-rk2mb3ti]
tencentcloud_kubernetes_node_pool.mynodepool: Refreshing state... [id=cls-rk2mb3ti#np-5hm1yrx8]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

```
